#  Exploratory Data Analysis With Pandas

### Overview

In this lesson, students will begin using Pandas for exploratory data analysis. This will include filtering and sorting data to generate insights.

### Learning Objectives

* Use Pandas to read in a data set
* Use DataFrame attributes and methods to investigate a data set's integrity
* Apply filters and sorting to DataFrames

## Meet Pandas

#### What is Pandas?

In [ ]:
conda install pandas -y

In [1]:
# What is Pandas?
import pandas as pd
print(pd.__version__)
print(pd.__package__)
print(pd.__doc__)

1.4.1
pandas

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

###  Reading a Data Set

In [2]:
# set some variables
file_address = 'data/chipotle.tsv'
delimiter_character = '\t'

In [5]:
# read in a file
data_frame = pd.read_csv(file_address,sep=delimiter_character)
data_frame[:5]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

###  Series vs. DataFrames

In [8]:
# A series
data_frame[['item_name']]

                                  item_name
0              Chips and Fresh Tomato Salsa
1                                      Izze
2                          Nantucket Nectar
3     Chips and Tomatillo-Green Chili Salsa
4                              Chicken Bowl
...                                     ...
4617                          Steak Burrito
4618                          Steak Burrito
4619                     Chicken Salad Bowl
4620                     Chicken Salad Bowl
4621                     Chicken Salad Bowl

[4622 rows x 1 columns]

In [12]:
# A dataframe
data_frame[['item_name','item_price']]

                                  item_name item_price
0              Chips and Fresh Tomato Salsa     $2.39
1                                      Izze     $3.39
2                          Nantucket Nectar     $3.39
3     Chips and Tomatillo-Green Chili Salsa     $2.39
4                              Chicken Bowl    $16.98
...                                     ...        ...
4617                          Steak Burrito    $11.75
4618                          Steak Burrito    $11.75
4619                     Chicken Salad Bowl    $11.25
4620                     Chicken Salad Bowl     $8.75
4621                     Chicken Salad Bowl     $8.75

[4622 rows x 2 columns]

###  Accessing and Modifying the Index

In [ ]:
data_frame.index

In [13]:
data_frame[:5]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [14]:
column_name = 'order_id'
data_frame.set_index(column_name, inplace=True)
# data_frame[:5]

,quantity,item_name,choice_description,item_price
order_id,,,,
1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,Izze,[Clementine],$3.39
1,1,Nantucket Nectar,[Apple],$3.39
1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...
1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

###  Columns and Data Types

In [19]:
data_frame.columns # Prints all the column names

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [20]:
data_frame.dtypes # Prints all the data types, but is hard to read!

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [21]:
# Easy-to-read DataFrame of the data types: 
pd.DataFrame(data_frame.dtypes, columns=['DataType'])

                   DataType
order_id              int64
quantity              int64
item_name            object
choice_description   object
item_price           object

###  Renaming Columns

In [22]:
# the "head" of a file
file_address = 'data/mtcars.csv'
delimiter_character = ','
df = pd.read_csv(file_address,sep=delimiter_character)
df.head(5)

,name,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,Blue
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,Black
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,Red
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,Red
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,Silver

In [23]:
# renaming
df.rename(columns={'name': 'model'}, inplace=True)
df.head(3)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,Blue
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,Black
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,Red

###  Common Column Operations

In [24]:
df['mpg'].describe()

count    32.000000
mean     20.090625
std       6.026948
min      10.400000
25%      15.425000
50%      19.200000
75%      22.800000
max      33.900000
Name: mpg, dtype: float64

In [25]:
df['cyl'].value_counts()

8    14
4    11
6     7
Name: cyl, dtype: int64

In [26]:
df['model'].unique()

array(['Mazda RX4', 'Mazda RX4 Wag', 'Datsun 710', 'Hornet 4 Drive',
       'Hornet Sportabout', 'Valiant', 'Duster 360', 'Merc 240D',
       'Merc 230', 'Merc 280', 'Merc 280C', 'Merc 450SE', 'Merc 450SL',
       'Merc 450SLC', 'Cadillac Fleetwood', 'Lincoln Continental',
       'Chrysler Imperial', 'Fiat 128', 'Honda Civic', 'Toyota Corolla',
       'Toyota Corona', 'Dodge Challenger', 'AMC Javelin', 'Camaro Z28',
       'Pontiac Firebird', 'Fiat X1-9', 'Porsche 914-2', 'Lotus Europa',
       'Ford Pantera L', 'Ferrari Dino', 'Maserati Bora', 'Volvo 142E'],
      dtype=object)

In [27]:
df['model'].nunique()

32

## Filtering and Sorting Data

###  The Boolean Mask

In [28]:
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,Blue
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,Black
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,Red
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,Red
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,Silver

In [29]:
#  The Boolean Mask
df['cyl'] == 6

0      True
1      True
2     False
3      True
4     False
5      True
6     False
7     False
8     False
9      True
10     True
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29     True
30    False
31    False
Name: cyl, dtype: bool

In [32]:
#  The Boolean Mask, cont.
df[df['cyl'] == 6].tail(3)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
9,Merc 280,19.2,6,167.6,123,3.92,3.44,18.3,1,0,4,4,Black
10,Merc 280C,17.8,6,167.6,123,3.92,3.44,18.9,1,0,4,4,Red
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.77,15.5,0,1,5,6,Silver

###  DataFrame Syntax Chaining

In [33]:
df['color'] == 'Blue'

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24     True
25     True
26    False
27    False
28    False
29    False
30    False
31     True
Name: color, dtype: bool

In [36]:
# Access the mpg column of all results passing the filter:
df[df['color'] == 'Blue']['mpg']

0     21.0
12    17.3
24    19.2
25    27.3
31    21.4
Name: mpg, dtype: float64

In [38]:
df['mpg'].describe()

count    32.000000
mean     20.090625
std       6.026948
min      10.400000
25%      15.425000
50%      19.200000
75%      22.800000
max      33.900000
Name: mpg, dtype: float64

In [37]:
# Gives numerical summaries based only on results passing the filter
df[df['color'] == 'Blue']['mpg'].describe()

count     5.000000
mean     21.240000
std       3.758058
min      17.300000
25%      19.200000
50%      21.000000
75%      21.400000
max      27.300000
Name: mpg, dtype: float64

###  Filtering by Multiple Conditions

In [41]:
df[df['mpg'] > 20].head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,Blue
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,Black
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,Red
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,Red
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2,Black

In [42]:
# Adding more conditions uses the same syntax, 
# even if it looks more complicated
df[(df['color'] == 'Silver') & (df['mpg'] > 20)]

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2,Silver
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1,Silver
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2,Silver

In [43]:
# The parentheses here are very important! 
# Leaving them out will usually trigger an error.
df[(df['color'] == 'Silver') | (df['mpg'] > 32)]

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,color
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,Silver
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4,Silver
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4,Silver
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1,Black
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2,Silver
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1,Black
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1,Silver
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2,Silver
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4,Silver
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2,Silver
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6,Silver

###  Sorting

In [ ]:
# For a Series object, no need to specify column: There's only one!
df['mpg'].sort_values().head()

In [ ]:
# For a DataFrame, it will sort by index unless given a column name. 
df.sort_values(by='mpg', ascending=True).head()

###  Accessing an Individual Row

In [ ]:
# We can use the iloc property to use indexing syntax
df.sort_values(by="mpg").iloc[[0]]

In [ ]:
# We could also simply use one bracket
df.sort_values(by="mpg").iloc[0]